МПР/src/Enums/ds_РежимыОбъединенияСкидок/ds_РежимыОбъединенияСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ds_РежимыОбъединенияСкидок</name>
  <enumValues>
    <name>НеНачислятьНаСуммуДругихСкидок</name>
  </enumValues>
  <enumValues>
    <name>НеНачислятьНаТоварыСоСкидкой</name>
  </enumValues>
  <enumValues>
    <name>НачислятьНаВсе</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Documents/НачислениеИСписаниеБонусныхБаллов/НачислениеИСписаниеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеИСписаниеБонусныхБаллов</name>
  <registerRecords>AccumulationRegister.БонусныеБаллы</registerRecords>
  <attributes>
    <name>МаркетинговаяАкция</name>
    <type>
      <types>DocumentRef.МаркетинговаяАкция</types>
    </type>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <type>
      <types>DefinedType.БонуснаяПрограммаСервисЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоНачисления</name>
    <type>
      <types>DefinedType.ПравилаНачисленияБонусныхБалловСервисЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисление</name>
    <attributes>
      <name>ДисконтнаяКарта</name>
      <type>
        <types>CatalogRef.ИнформационныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ДисконтнаяКарта</name>
      <type>
        <types>CatalogRef.ИнформационныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БаллыКСписанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МПР/src/Catalogs/БонусныеПрограммыЛояльности/БонусныеПрограммыЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БонусныеПрограммыЛояльности</name>
  <predefined>
    <items>
      <name>GMB</name>
      <description>GetMeBack</description>
    </items>
    <items>
      <name>UDS</name>
      <description>UDS</description>
    </items>
  </predefined>
  <attributes>
    <name>КурсКонвертацииБонусовВВалюту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПроцентОплатыБонусами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКонвертацииБонусов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретНачисленияБалловПриОплатеБонусами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатуры</name>
    <type>
      <types>DefinedType.СегментНоменклатурыСервисЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>DefinedType.ВидОплатыСервисЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>УменьшатьСуммуЧекаДляСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>МаксимальныйПроцентОплатыБонусами</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МПР/src/Catalogs/ds_НастройкиUDS/ds_НастройкиUDS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ds_НастройкиUDS</name>
  <predefined>
    <items>
      <name>Основная</name>
      <description>Основная</description>
    </items>
  </predefined>
  <attributes>
    <name>ApiKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>68</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDКомпании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимОбъединенияСкидок</name>
    <type>
      <types>EnumRef.ds_РежимыОбъединенияСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНачисленияЗаНаличнуюОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДополнительныхНачислений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

МПР/src/Catalogs/ИнформационныеКарты/ИнформационныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеКарты</name>
  <comment>(Упр) Магнитные и штриховые карты.</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>GMB</name>
      <description>GetMeBack</description>
    </items>
    <items>
      <name>UDS</name>
      <description>UDS</description>
    </items>
  </predefined>
  <attributes>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.БонусныеПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДляНакоплений</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВладельцаКартыПоШаблону</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МПР/src/CommonModules/ds_UDS/Module.bsl
//API UDS V2

Функция ПолучитьИнформациюССервера2(КодUDS) Экспорт
	ПараметрыКомпании = "partner/v2/settings"; //https://api.uds.app/partner/v2/settings
	Если СтрДлина(КодUDS) = 6 Тогда
		ПараметрыПользователяUDS = "/partner/v2/customers/find?code=" + КодUDS;
		// теперь есть два варианта https://api.uds.app/partner/v2/customers/find?code=456123&phone=+71234567898&uid=23684cea-ca50-4c5c-b399-eb473e85b5ad
		// и 'https://api.uds.app/partner/v2/customers/'.$customerId
	ИначеЕсли СтрДлина(КодUDS) = 10 Тогда
		ПараметрыПользователяUDS = "/partner/v2/customers/find?phone=%2B7" + КодUDS;
	Иначе
		ПараметрыПользователяUDS = "/partner/v2/customers/find?uid=" + КодUDS;
	КонецЕсли;
	
	СтруктураОтветаОКомпании = ОтправитьЗапросНаСерверUDS2(ПараметрыКомпании,"Получить");
	СтруктураОтвета = ОтправитьЗапросНаСерверUDS2(ПараметрыПользователяUDS,"Получить",,КодUDS);
	
	Если НЕ СтруктураОтветаОКомпании = Ложь И НЕ СтруктураОтвета = Ложь Тогда 
		Для Каждого СтрокаСтруктуры из СтруктураОтветаОКомпании Цикл
			СтруктураОтвета.Вставить(СтрокаСтруктуры.Ключ, СтрокаСтруктуры.Значение);
		КонецЦикла;	
	КонецЕсли;
	//СтруктураОтвета.Вставить("КодUDS",КодUDS);
	
	Если СтрДлина(КодUDS) = 10 Тогда
		Если НЕ СтруктураОтвета = Ложь Тогда
			СтруктураОтвета.user.participant.points = 0;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
КонецФункции

Функция ОтправитьЗапросНаСерверUDS2(ПараметрыЗапроса,РежимСоединения,СтрокаJSON="",КодUDS="")
	
	НастройкиUDS = НастройкиUDS();
	
	ApiKey = НастройкиUDS.ApiKey;
	IDКомпании = НастройкиUDS.IDКомпании;
	
	Если ApiKey = "" ИЛИ IDКомпании = "" Тогда
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("errorCode", "forbidden");
		Возврат СтруктураОтвета;
	КонецЕсли;
	Сервер = "api.uds.app";
	XOriginRequestId = Строка(Новый УникальныйИдентификатор());
	XTimestamp = Строка(Формат(ТекущаяДата(), "ДФ=yyyy-MM-ddT05hh:mm:ssZ"));
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаТекста.OEM);
    Запись.Записать(Строка(IDКомпании)+":"+Строка(ApiKey));
    Запись.Закрыть();
	ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
	
	СтрокаАвторизации = "";
	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(Base64Строка(ДвДанные),Символы.ПС);
	Для Ит = 1 по МассивПодстрок.Количество() Цикл
		СтрокаАвторизации = СтрокаАвторизации + ?(Ит = МассивПодстрок.Количество(), МассивПодстрок[Ит - 1], Лев(МассивПодстрок[Ит - 1], СтрДлина(МассивПодстрок[Ит - 1])-1));
	КонецЦикла;
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL();
	HTTPСоединение = Новый HTTPСоединение(Сервер,,,,,10,ssl);
	
	ТекстЗапроса = Новый HTTPЗапрос;
	ТекстЗапроса.Заголовки.Вставить("Accept", "application/json");
	ТекстЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	ТекстЗапроса.Заголовки.Вставить("X-Origin-Request-Id", Строка(XOriginRequestId));
	ТекстЗапроса.Заголовки.Вставить("X-Timestamp", Строка(XTimestamp));
	ТекстЗапроса.Заголовки.Вставить("Authorization", "Basic " + СтрокаАвторизации);
	ТекстЗапроса.АдресРесурса = ПараметрыЗапроса;
	ТекстЗапроса.УстановитьТелоИзСтроки(СтрокаJSON, "windows-1251", ИспользованиеByteOrderMark.НеИспользовать);
	
	Если РежимСоединения = "Получить" Тогда
		Ответ = HTTPСоединение.Получить(ТекстЗапроса);
	ИначеЕсли РежимСоединения = "Отправить" Тогда
		Ответ = HTTPСоединение.ОтправитьДляОбработки(ТекстЗапроса);
	ИначеЕсли РежимСоединения = "Возврат" Тогда
		Ответ = HTTPСоединение.ОтправитьДляОбработки(ТекстЗапроса);	
	КонецЕсли;
	РезультатОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
	ЧтениеИнформацииОтСервера = Новый ЧтениеJSON;
	ЧтениеИнформацииОтСервера.УстановитьСтроку(РезультатОтвета);
	СтруктураОтвета = ПрочитатьJSON(ЧтениеИнформацииОтСервера);
	
	СтруктураОтвета = ПроверкаНаОшибки2(СтруктураОтвета,РежимСоединения,КодUDS);
	Если СтруктураОтвета = Ложь Тогда
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(Знач Значение, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, 
	СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Если Разделитель = "," 
		И ПропускатьПустыеСтроки = Неопределено 
		И СокращатьНепечатаемыеСимволы Тогда 
		
		Результат = СтрРазделить(Значение, ",", Ложь);
		Для Индекс = 0 По Результат.ВГраница() Цикл
			Результат[Индекс] = СокрЛП(Результат[Индекс])
		КонецЦикла;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Значение) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = СтрНайти(Значение, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Значение, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Значение = Сред(Значение, Позиция + СтрДлина(Разделитель));
		Позиция = СтрНайти(Значение, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Значение) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Значение));
		Иначе
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ПроверкаНаОшибки2(СтруктураОтвета, Режим, КодUDS="")
	Для Каждого ПроверяемаяСтрока из СтруктураОтвета Цикл
		Если ПроверяемаяСтрока.Ключ = "errorCode" Тогда
			Если ПроверяемаяСтрока.Значение = "forbidden" Тогда
				Сообщить("Ключ АПИ не совпадает со значением на сервере. Используйте обработку Ввести Апи Ключ");
			ИначеЕсли ПроверяемаяСтрока.Значение = "notFound" Тогда
				Если Режим = "Получить" Тогда
					Если СтрДлина(КодUDS) = 10 Тогда
						Сообщить("Клиент с указанным номером телефона обслуживается впервые. Баллы будут начисленны по номеру телефона.");
					Иначе
						Сообщить("По данному коду имя клиента не найдено! Проверьте код скидки и сделайте поиск дисконтной карты ещё раз! Транзакция прервана!");
					КонецЕсли;
				ИначеЕсли Режим = "Отправить" Тогда
					Сообщить("Код на проведение оплаты не актуален, введите код скидки или номер телефона повторно.");
				ИначеЕсли Режим = "Возврат" Тогда
					Сообщить("Номер операции для возврата не найден");
				КонецЕсли;
			ИначеЕсли ПроверяемаяСтрока.Значение = "discountLimitExceed" Тогда
				Сообщить("Превышен процент счета, доступный к погашению баллами");
			ИначеЕсли ПроверяемаяСтрока.Значение = "badRequest" Тогда
				Если СтруктураОтвета.errors[0].errorCode = "invalid.phoneNumber" Тогда
					Сообщить("Ошибка в номере телефона! Транзакция прервана!");
				ИначеЕсли СтруктураОтвета.errors[0].errorCode = "uuid.invalid" Тогда
					Сообщить("Ошибка в идентификаторе клиента! Транзакция прервана!");
				Иначе
					Сообщить("Возвращаемая ошибка: "+СтруктураОтвета.errors[0].type+"; "+СтруктураОтвета.errors[0].message+"; "+СтруктураОтвета.errors[0].field);
				КонецЕсли;
			ИначеЕсли ПроверяемаяСтрока.Значение = "insufficientFunds" Тогда
				Сообщить("Попытка списания баллов больше чем есть у клиента на балансе");
			ИначеЕсли ПроверяемаяСтрока.Значение = "companyIsInactive" Тогда
				Сообщить("Компания не активна. Продлите пожалуйста подписку UDS");
			ИначеЕсли ПроверяемаяСтрока.Значение = "invalidChecksum" Тогда
				Сообщить("Не верная контрольная сумма. Сумма оплаты + сумма баллов должна равняться сумме докумета реализации");
			ИначеЕсли ПроверяемаяСтрока.Значение = "cashierNotFound" Тогда
				Сообщить("Внешний идентификатор кассира не совпадает с именем пользователя! Транзакция на сервере отменена! Баллы не начислены и не списаны! Исправьте ошибку и проведите процедуру оплаты заново, либо проведите оплату по мобильному приложению UDS Cashier");
			ИначеЕсли ПроверяемаяСтрока.Значение = "withdrawNotPermitted" Тогда
				Сообщить("По номеру телефона невозможно списывать баллы, только накапливать");
			КонецЕсли;
			Отказ = Истина;
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Если Режим = "Отправить" Тогда
		Сообщить("Оплата на сервере UDS Game выполнена успешно!");
	ИначеЕсли Режим = "Возврат" Тогда
		Сообщить("Возврат на сервере UDS Game выполнен успешно!");
	КонецЕсли;
	Возврат СтруктураОтвета;
КонецФункции

Функция ПровестиОплатуНаСервереUDS2(СтруктураОтправкиДанных) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Истина;
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтправкиДанных);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	ПараметрыЗапроса = "partner/v2/operations";
	
	СтруктураОтвета = ОтправитьЗапросНаСерверUDS2(ПараметрыЗапроса,"Отправить",СтрокаJSON);
	//ПроверкаНаОшибки2(СтруктураОтвета, "Отправить");
	Если НЕ СтруктураОтвета = Ложь Тогда
		Если НЕ СтруктураОтвета.Свойство("errorCode") Тогда
			IDОперации = Формат(СтруктураОтвета.id,"ЧН=0; ЧГ=");
		Иначе
			IDОперации = "";
		КонецЕсли;
	КонецЕсли;
	Возврат IDОперации;
КонецФункции

Процедура ВыполнитьВозвратБалловUDS2(ЧекККМСсылка,СуммаВозврата) Экспорт
	
	Если ЗначениеЗаполнено(ЧекККМСсылка) Тогда 
		IDОперации = ЧекККМСсылка.Комментарий;
	
		СтруктураОтправкиДанных = Новый Структура;
		СтруктураОтправкиДанных.Вставить("partialAmount",СуммаВозврата);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру = Истина;
		
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");	
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, СтруктураОтправкиДанных);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		ПараметрыВозврата = "/partner/v2/operations/"+IDОперации+"/refund";
		СтруктураОтветаОВозврате = ОтправитьЗапросНаСерверUDS2(ПараметрыВозврата,"Возврат",СтрокаJSON);
		ОстаткиБонусныхБаллов = ПроверкаБонусныхБалловДК(ЧекККМСсылка.ДисконтнаяКарта);
		СписатьБаллыСДК(ЧекККМСсылка.ДисконтнаяКарта,СуммаВозврата-ЧекККМСсылка.СуммаДокумента);  
	КонецЕсли;	
		
КонецПроцедуры

Процедура НачислитьБаллыНаДК(ДисконтнаяКарта,НачисляемыеБаллы) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	НачислимБонусы = Документы.НачислениеИСписаниеБонусныхБаллов.СоздатьДокумент();
	НачислимБонусы.Дата = ТекущаяДата();
	НачислимБонусы.БонуснаяПрограммаЛояльности = Справочники.БонусныеПрограммыЛояльности.UDS;
	ДобавимСтроку = НачислимБонусы.Начисление.Добавить();
	ДобавимСтроку.ДисконтнаяКарта = ДисконтнаяКарта;
	ДобавимСтроку.Баллы = НачисляемыеБаллы;
	НачислимБонусы.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура СписатьБаллыСДК(ДисконтнаяКарта,СписываемыеБаллы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СпишемБонусы = Документы.НачислениеИСписаниеБонусныхБаллов.СоздатьДокумент();
	СпишемБонусы.Дата = ТекущаяДата();
	СпишемБонусы.БонуснаяПрограммаЛояльности = Справочники.БонусныеПрограммыЛояльности.UDS;
	ДобавимСтроку = СпишемБонусы.Списание.Добавить();
	ДобавимСтроку.ДисконтнаяКарта = ДисконтнаяКарта;
	ДобавимСтроку.Баллы = СписываемыеБаллы;
	СпишемБонусы.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

Функция ПроверкаБонусныхБалловДК(ДисконтнаяКарта) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ОстаткиБонусныхБаллов = БонусныеБаллыСервер.ОстаткиИДвиженияБонусныхБаллов(ДисконтнаяКарта,КонецДня(ТекущаяДата()));
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ОстаткиБонусныхБаллов[0].Сумма;
КонецФункции

Процедура ДобавитьIDUDSВДок(IDОперацииUDS,ЧекККМСсылка) Экспорт
	ДобавимIDВДок = ЧекККМСсылка.ПолучитьОбъект();
	ДобавимIDВДок.Комментарий = IDОперацииUDS;
	ДобавимIDВДок.Записать();
КонецПроцедуры

Функция ПроверитьРежимОбъединенияСкидок() Экспорт
	Режим = НастройкиUDS().РежимОбъединенияСкидок;
	
	Если Режим = Перечисления.ds_РежимыОбъединенияСкидок.НеНачислятьНаСуммуДругихСкидок Тогда
		Возврат "НеНачислятьНаСуммуДругихСкидок";
	ИначеЕсли Режим = Перечисления.ds_РежимыОбъединенияСкидок.НеНачислятьНаТоварыСоСкидкой Тогда
		Возврат "НеНачислятьНаТоварыСоСкидкой";
	Иначе
		Возврат "НачислятьНаВсе";
	КонецЕсли;
КонецФункции

Процедура ПровестиДополнительноеНачисление(ДК,Сумма) Экспорт
	
	НастройкиUDS = НастройкиUDS();
	
	Если НастройкиUDS.ДополнительныеНачисленияЗаНаличнуюОплату Тогда
		ПараметрыЗапроса = "partner/v2/operations/reward";
		МассивДК = Новый Массив;
		МассивДК.Добавить(ДК.КодКарты);
		ПроцентДоначисления = НастройкиUDS.ПроцентДополнительныхНачислений;
		Если Не ЗначениеЗаполнено(ПроцентДоначисления) Тогда
			ПроцентДоначисления = 0;
		КонецЕсли;
		СтруктураОтправкиДанных = Новый Структура;
		СтруктураОтправкиДанных.Вставить("points",Окр(Сумма*ПроцентДоначисления/100,0));
		СтруктураОтправкиДанных.Вставить("comment","Дополнительное начисление баллов за оплату наличными");
		СтруктураОтправкиДанных.Вставить("participants",МассивДК);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру = Истина;
		
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");	
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, СтруктураОтправкиДанных);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		РезультатДоначисления = ОтправитьЗапросНаСерверUDS2(ПараметрыЗапроса,"Отправить",СтрокаJSON);
	КонецЕсли;
КонецПроцедуры

Функция ВернутьВидОплатыНаличные() Экспорт
	Возврат Справочники.ВидыОплатЧекаККМ.Наличные;
КонецФункции

Функция Транслитерация(Слово) Экспорт 

	 НовоеСлово= "";
	 спТранслит = Новый СписокЗначений;
	 
	 спТранслит.Добавить("й","j");
	 спТранслит.Добавить("ц","c");
	 спТранслит.Добавить("у","u");
	 спТранслит.Добавить("к","k");
	 спТранслит.Добавить("е","e");
	 спТранслит.Добавить("н","n");
	 спТранслит.Добавить("г","g");
	 спТранслит.Добавить("ш","sh");
	 спТранслит.Добавить("щ","sch");
	 спТранслит.Добавить("з","z");
	 спТранслит.Добавить("х","h");
	 спТранслит.Добавить("ъ","_");
	 спТранслит.Добавить("ф","f");
	 спТранслит.Добавить("ы","y");
	 спТранслит.Добавить("в","v");
	 спТранслит.Добавить("а","a"); 
	 спТранслит.Добавить("п","p"); 
	 спТранслит.Добавить("р","r"); 
	 спТранслит.Добавить("о","o"); 
	 спТранслит.Добавить("л","l"); 
	 спТранслит.Добавить("д","d"); 
	 спТранслит.Добавить("ж","zh"); 
	 спТранслит.Добавить("э","je"); 
	 спТранслит.Добавить("я","ja"); 
	 спТранслит.Добавить("ч","ch"); 
	 спТранслит.Добавить("с","s"); 
	 спТранслит.Добавить("м","m"); 
	 спТранслит.Добавить("и","i"); 
	 спТранслит.Добавить("т","t"); 
	 спТранслит.Добавить("ь","_"); 
	 спТранслит.Добавить("б","b"); 
	 спТранслит.Добавить("ю","ju");
	 спТранслит.Добавить("ё","jo");
	 //////Укр
	 ////спТранслит.Добавить("je","є");
	 ////спТранслит.Добавить("i'","ї");
	 ////спТранслит.Добавить("i","і");
	 //Лат
	 спТранслит.Добавить("i","i"); 
	 спТранслит.Добавить("q","q");
	 спТранслит.Добавить("w","w");
	 спТранслит.Добавить("e","e");
	 спТранслит.Добавить("r","r");
	 спТранслит.Добавить("t","t");
	 спТранслит.Добавить("y","y");
	 спТранслит.Добавить("u","u");
	 спТранслит.Добавить("i","i");
	 спТранслит.Добавить("o","o");
	 спТранслит.Добавить("p","p");
	 спТранслит.Добавить("","");
	 спТранслит.Добавить("a","a");
	 спТранслит.Добавить("s","s");
	 спТранслит.Добавить("d","d");
	 спТранслит.Добавить("f","f");
	 спТранслит.Добавить("g","g");
	 спТранслит.Добавить("h","h");
	 спТранслит.Добавить("j","j");
	 спТранслит.Добавить("k","k");
	 спТранслит.Добавить("l","l");
	 спТранслит.Добавить("z","z");
	 спТранслит.Добавить("x","x");
	 спТранслит.Добавить("c","c");
	 спТранслит.Добавить("v","v");
	 спТранслит.Добавить("b","b");
	 спТранслит.Добавить("n","n");
	 спТранслит.Добавить("m","m");
	  
	 спТранслит.Добавить(" ","_");
	 спТранслит.Добавить("""","""");
	 спТранслит.Добавить("-","_");
	 спТранслит.Добавить(".","_");
	 спТранслит.Добавить(",","_");
	 спТранслит.Добавить("/","_");
	 спТранслит.Добавить("\","_");
	 спТранслит.Добавить("*","_");
	 спТранслит.Добавить("#","_");  
	 спТранслит.Добавить("#","_"); 
	 спТранслит.Добавить("|","_"); 
	 
	 спТранслит.Добавить("!","_"); 
	 спТранслит.Добавить("?","_"); 
	 
	 спТранслит.Добавить("$","_"); 
	 спТранслит.Добавить("%","_"); 
	 спТранслит.Добавить("@","_"); 
	 спТранслит.Добавить("&","_"); 
	 спТранслит.Добавить("=","_"); 
	 спТранслит.Добавить("+","_"); 
	 
	 спТранслит.Добавить("~","_"); 
	 спТранслит.Добавить("'","_"); 
	 спТранслит.Добавить("`","_"); 
	 спТранслит.Добавить(":","_"); 
	 спТранслит.Добавить(";","_"); 
	 
	 спТранслит.Добавить("(","_");
	 спТранслит.Добавить(")","_");  
	 спТранслит.Добавить("[","_"); 
	 спТранслит.Добавить("]","_");  
	 спТранслит.Добавить("}","_"); 
	 спТранслит.Добавить("{","_");
	 спТранслит.Добавить("0","0");
	 спТранслит.Добавить("1","1");
	 спТранслит.Добавить("2","2");
	 спТранслит.Добавить("3","3");
	 спТранслит.Добавить("4","4");
	 спТранслит.Добавить("5","5");
	 спТранслит.Добавить("6","6");
	 спТранслит.Добавить("7","7");
	 спТранслит.Добавить("8","8");  
	 спТранслит.Добавить("9","9");
	 Для а=1 по СтрДлина(Слово) Цикл
	  НовоеСлово = НовоеСлово + спТранслит.НайтиПоЗначению(НРЕГ(Сред(Слово,а,1)));
	 КонецЦикла; 
	 
	 Возврат НРЕГ(НовоеСлово);
	
 КонецФункции
 
Функция НастройкиUDS()
 	
 	Запрос = Новый Запрос;
 	Запрос.Текст = 
 	"ВЫБРАТЬ ПЕРВЫЕ 1
 	|	ds_НастройкиUDS.ApiKey,
 	|	ds_НастройкиUDS.IDКомпании,
 	|	ds_НастройкиUDS.ПроцентДополнительныхНачислений,
 	|	ds_НастройкиUDS.РежимОбъединенияСкидок,
 	|	ds_НастройкиUDS.ДополнительныеНачисленияЗаНаличнуюОплату
 	|ИЗ
 	|	Справочник.ds_НастройкиUDS КАК ds_НастройкиUDS";
 	
 	Выборка = Запрос.Выполнить().Выбрать();
 	Выборка.Следующий();
 	
 	Возврат Выборка;
 	
 КонецФункции
 
Функция ЭтоКартаUDS(ДисконтнаяКарта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнформационныеКарты.Ссылка
	|ИЗ
	|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
	|ГДЕ
	|	ИнформационныеКарты.Ссылка = &Ссылка
	|	И ИнформационныеКарты.ВидДисконтнойКарты = ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.UDS)";
	Запрос.УстановитьПараметр("Ссылка", ДисконтнаяКарта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
